const textTH = {
  greeting: "สวัสดีครับ ผมชื่อ",
  role: "นักพัฒนา Front-End และ Blackend.",
  fullname: "วาคิม สุทธิ",
  viewProjects: "ดูผลงานของฉัน",
  featuredProjects: "โปรเจ็กต์ของฉัน",
  projectTitle: "ชื่อโปรเจกต์",
  projectDesc: "คำอธิบายสั้น ๆ เกี่ยวกับเทคโนโลยีที่ใช้และสิ่งที่โปรเจกต์ทำได้",
  viewDemo: "ดูตัวอย่าง",
  viewCode: "ซอร์สโค้ด",
  contactMe: "ติดต่อฉัน",
  copyright: "สงวนลิขสิทธิ์ทั้งหมด",
  skills: "ทักษะของฉัน",
  skillsDesc:"นี่คือเทคโนโลยีและเครื่องมือที่ฉันเชี่ยวชาญสำหรับโครงการพัฒนา",

  about: {
    title: "เกี่ยวกับฉัน",
    content:
      "ผมเป็นนักพัฒนาเว็บที่หลงใหลในเทคโนโลยีสมัยใหม่ การเขียนโค้ดที่สะอาด อ่านง่าย และการสร้างเว็บไซต์ที่ใช้งานง่าย พร้อมเปิดรับการเรียนรู้สิ่งใหม่ ๆ และพัฒนาตัวเองผ่านการลงมือทำจริงและการทำงานร่วมกับผู้อื่น",
    education: "การศึกษา",
    major: " ปริญาตรี สาขา เทคโนโลยีสารสนเทศ (IT) คณะเทคโนโลยีสารสนเทศ (IT)",
    university_name: "จบจาก",
    university: "มหาวิทยาลัยมหาสารคาม",
  },

  projects_name: {
    title: "ระบบขออนุญาติและออกเอกสาร PDF",
    desc: "เว็บสําหรับขออนุญาติและสร้างเอกสาร PDF สร้างด้วย nextjs ในส่วน เอกสารใช้เป็น react-pdf...",

    title2: "blogapp ",
    desc2: "เว็บบล็อกที่สร้างด้วย nextjs ใช้ MongoDB เป็นฐานข้อมูลและ NextAuth สำหรับการตรวจสอบสิทธิ์ของผู้ใช้ ระบบอนุญาตให้ผู้ใช้ลงทะเบียน เข้าสู่ระบบ สร้างบทความ และโพสต์ความคิดเห็น รวมถึงแผงควบคุมสำหรับผู้ดูแลระบบในการจัดการโพสต์ ความคิดเห็น และบัญชีผู้ใช้",
  },

  downloadResume: "ดาวน์โหลดเรซูเม่",
  resume: "เรซูเม่",

  nav: {
    home: "หน้าแรก",
    about: "เกี่ยวกับ",
    skills: "ทักษะ",
    services: "บริการ",
    projects: "ผลงาน",
    contact: "ติดต่อ",
  },

  nameservices: "บริการ",
  // Language switcher
  Scrollup: {
    scrollToTop: "เลื่อนขึ้นไปด้านบน",
  },

  services: {
    webdev: {
      title: "ซอฟต์แวร์และการพัฒนาเว็บไซต์",
      desc: "พัฒนาเว็บไซต์ด้วย React, Next.js, Vue.js และ Nuxt.js พร้อมการใช้ Tailwind CSS และ TypeScript สำหรับแอปพลิเคชันที่มีประสิทธิภาพและรองรับทุกอุปกรณ์",
    },
    database: {
      title: "ฐานข้อมูล",
      desc: "ออกแบบและจัดการฐานข้อมูลทั้งแบบ SQL และ NoSQL เพื่อจัดเก็บข้อมูลอย่างมีประสิทธิภาพและปลอดภัย",
    },
    backend: {
      title: "การพัฒนา Backend",
      desc: "พัฒนา API และระบบ Backend ด้วย Node.js, Express เพื่อรองรับการทำงานของแอปพลิเคชัน",
    },
    mobile: {
      title: "การพัฒนาแอปพลิเคชันมือถือ",
      desc: "พัฒนาแอปพลิเคชันมือถือแบบ Cross-พัฒนาแอปพลิเคชันมือถือด้วย React Native และ Flutter เพื่อสร้างประสบการณ์ผู้ใช้ที่ดีบนทั้ง iOS และ Android ด้วย React Native สำหรับทั้ง iOS และ Android",
    },
    design: {
      title: "การออกแบบ UI/UX",
      desc: "ออกแบบส่วนติดต่อผู้ใช้ที่สวยงามและใช้งานง่าย ด้วยหลักการ UX/UI ที่ทันสมัย",
    },
    devtools: {
      title: "เครื่องมือและเทคโนโลยีการพัฒนา",
      desc: "ใช้เครื่องมือต่างๆ เพื่อเพิ่มประสิทธิภาพในกระบวนการพัฒนาซอฟต์แวร์",
    },
    tools: {
      title: "เครื่องมือและเทคโนโลยี",
      desc: "ใช้เครื่องมือต่างๆ เพื่อเพิ่มประสิทธิภาพในกระบวนการพัฒนาซอฟต์แวร์",
    },
  },
  
  LinkedIn: "LinkedIn ใช้งานไม่ได้ในขณะนี้",

};

export default textTH;
